
/* Вывести на экран числа от 1 до 10, используя цикл while.*/
package module2.task6;

public class Subtask8 {
    public static void main(String[] args) {
        int i = 1; //чуть внимательнее, числа от 1 до 10(Исправил) 
        while (i<=10){
            System.out.println(i);
            i++;
        }
    }
}
