/*В переменной n хранится вещественное число с ненулевой дробной частью.
Создайте программу, округляющую число n до ближайшего целого и выводящую результат на экран.
 */

package module2.task3;

public class Subtask3 {
    public static void main(String[] args) {

        double x = 3.6;

        System.out.println(Math.round(x));
    }
}
